ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_lcd.c
/*********************************************************************************************************//**
 * @file    ht32l5xxxx_lcd.c
 * @version $Rev:: 8333         $
 * @date    $Date:: 2025-01-17 #$
 * @brief   This file provides all the LCD firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32l5xxxx_lcd.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup LCD LCD
  * @brief LCD driver modules
  * @{
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup LCD_Exported_Functions LCD exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the LCD peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void LCD_DriverDeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};
  RSTCUReset.Bit.LCD = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initializes the LCD peripheral according to the specified parameters in the LCD_InitStruct.
 * @param LCD_InitStruct: pointer to a LCD_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void LCD_DriverInit(LCD_InitTypeDef* LCD_InitStruct)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD control register.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->FCR = (u32)(LCD_InitStruct->LCD_Prescaler) |
                (u32)(LCD_InitStruct->LCD_Divider);

  HT_LCD->CR = (u32)(LCD_InitStruct->LCD_Waveform) |
               (u32)(LCD_InitStruct->LCD_Bias) |
               (u32)(LCD_InitStruct->LCD_Duty) |
               (u32)(LCD_InitStruct->LCD_VoltageSource);
}

/*********************************************************************************************************//**
 * @brief Configure the MCONT mask time.
 * @param Sel: specify the mask time.
 *   This parameter can be:
 *     @arg LCD_MaskTime_25ns : MCONT mask time is 25 ns
 *     @arg LCD_MaskTime_40ns : MCONT mask time is 40 ns
 * @retval None
 ************************************************************************************************************/
void LCD_MaskTimeConfig(LCD_MaskTime_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD control register.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 24)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable half of the low value resistor (HRLEN).
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void LCD_HalfRLCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_LCD->CR |= (1ul << 15);
  }
  else
  {
    HT_LCD->CR &= ~(1ul << 15);
  }
}

/*********************************************************************************************************//**
 * @brief Configure the STATIC switch.
 * @param Sel: specify the STATIC switch status.
 *   This parameter can be:
 *     @arg LCD_Static_Switch_Open  : STATIC switch is open during dead time.
 *     @arg LCD_Static_Switch_close : STATIC switch is closed during dead time.
 * @retval None
 ************************************************************************************************************/
void LCD_StaticSwitchConfig(LCD_StaticSwitch_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD control register.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 14)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure MuxCOM7 to be COM7 or SEGx.
 * @param Sel: Specify the MuxSEG.
 *   This parameter can be one of the following values:
 *     @arg LCD_MUXCOM7_IS_COM7  :
 *     @arg LCD_MUXCOM7_IS_SEGx  :(52341: SEG28, 57352: SEG36)
 * @retval None
 ************************************************************************************************************/
void LCD_MuxCOM7Config(LCD_MUXCOM7_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD control register.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

