ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_lcd.c
/*********************************************************************************************************//**
 * @brief Configure the LCD High Drive Duration Selection.
 * @param Sel: Specify LCD High Drive Duration Selection.
 *   This parameter LCD_DEAD_Enum can be one of the following values:
 *     @arg LCD_HighDrive_0      : No high drive
 *     @arg LCD_HighDrive_1      : High drive duration = 1 CK_PS pulses
 *     @arg LCD_HighDrive_2      : High drive duration = 2 CK_PS pulses
 *     @arg LCD_HighDrive_3      : High drive duration = 3 CK_PS pulses
 *     @arg LCD_HighDrive_4      : High drive duration = 4 CK_PS pulses
 *     @arg LCD_HighDrive_5      : High drive duration = 5 CK_PS pulses
 *     @arg LCD_HighDrive_6      : High drive duration = 6 CK_PS pulses
 *     @arg LCD_HighDrive_7      : High drive duration = 7 CK_PS pulses
 *     @arg LCD_HighDrive_Static : Static high drive
 ************************************************************************************************************/
void LCD_HighDriveConfig(LCD_HighDrive_Enum Sel)
{
  u32 FCR = HT_LCD->FCR;

  if (Sel == LCD_HighDrive_Static)
  {
    FCR |= (1ul << 0);
  }
  else
  {
    FCR &= ~(1ul << 0);
    FCR = (FCR & ~(7ul << 4)) | Sel;
  }

  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF));
  HT_LCD->FCR = FCR;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified LCD interrupts.
 * @param LCD_INT: Specify the LCD interrupt sources that is to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg LCD_INT_UDDIE : Update Display Done Interrupt Enable
 *     @arg LCD_INT_SOFIE : Start of Frame Interrupt Enable
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void LCD_IntConfig(u32 LCD_INT, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_LCD_INT(LCD_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_LCD->IER |= LCD_INT;
  }
  else
  {
    HT_LCD->IER &= ~LCD_INT;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specified LCD flag has been set.
 * @param LCD_FLAG: Specify the interrupt status to check.
 *   This parameter can be any combination of the following values:
 *     @arg LCD_FLAG_FCRSF : LCD Frame Control Register Synchronization Flag
 *     @arg LCD_FLAG_RDY   : Ready Flag
 *     @arg LCD_FLAG_UDD   : Update Display Done
 *     @arg LCD_FLAG_UDR   : Update Display Request
 *     @arg LCD_FLAG_SOF   : Start of Frame Flag
 *     @arg LCD_FLAG_ENS   : LCD Enabled Status
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus LCD_GetFlagStatus(u32 LCD_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_LCD_FLAG(LCD_FLAG));

  if ((HT_LCD->SR & LCD_FLAG) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief SET LCD Update Display Request.
 * @retval None
 ************************************************************************************************************/
void LCD_SetUpdateDisplayRequest(void)
{
  HT_LCD->SR |= LCD_FLAG_UDR;
}

/*********************************************************************************************************//**
 * @brief Clear the specified LCD flag.
 * @param LCD_Flag: specify the flag that is to be cleared.
 *   This parameter can be one of the following values:
 *     @arg LCD_CLR_UDDC : Update display done clear
 *     @arg LCD_CLR_SOFC : Start of frame flag clear
 * @retval None
 ************************************************************************************************************/
void LCD_ClearFlag(u32 LCD_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_LCD_CLEAR(LCD_Flag));

  HT_LCD->CLR = LCD_Flag;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
